package cn.gogoal.im.bean.infomation;

import java.util.List;

/**
 * author wangjd on 2017/6/19 0019.
 * Staff_id 1375
 * phone 18930640263
 * description :${annotated}.
 */
public class Sevenby24 {

    /**
     * message : 成功
     * data : [{"title":"【财政部：重点支持符合雄安新区等国家战略的PPP项目开展资产证券化】财联社19日讯，财政部近日印发关于规范开展政府和社会资本合作项目资产证券化有关事宜的通知。通知要求分类稳妥地推动PPP项目资产证券化，严格筛选开展资产证券化的PPP项目，重点支持符合雄安新区和京津冀协同发展、\u201c一带一路\u201d、长江经济带等国家战略的PPP项目开展资产证券化。 ","date":"2017-06-19 15:08:00"},{"title":"财联社19日讯，新一期全球超级计算机500强榜单19日公布，中国\u201c神威·太湖之光\u201d和\u201c天河二号\u201d第三次携手夺得前两名，美国20年来首次无缘前三。（新华社） ","date":"2017-06-19 14:57:00"},{"title":"【国债期货扩大涨幅创逾2个月新高】财联社19日讯，10年期国债期货主力合约T1709涨0.63%，创4月14日以来新高，10年国债和国开活跃券收益率下行均逾7bp。 ","date":"2017-06-19 14:51:00"},{"title":"【5月汽车经销商库存水平仍位于警戒线以上】财联社19日讯，从中国汽车流通协会获悉，5月份汽车经销商综合库存系数为1.58，同比上升14%，环比下降18%，经销商库存水平有所回落，但依然位于警戒线以上。 ","date":"2017-06-19 14:36:00"},{"title":"【快讯】财联社19日讯，新疆概念股午后走强，八一钢铁封涨停，西部建设涨7%，北新路桥、天山股份、新疆城建纷纷拉升。 ","date":"2017-06-19 14:03:00"},{"title":"【快讯】财联社19日讯，王者荣耀概念股走强，三维通信封涨停，雷柏科技涨逾8%，云图控股涨7%，龙头恒大高新连续三天涨停。AppAnnie发布的5月全球手游指数榜单显示，腾讯旗下的《王者荣耀》拿下了全球手游综合收入榜冠军。 ","date":"2017-06-19 13:19:00"},{"title":"【中国央行：金砖国家应建立PPP领域合作框架发展和完善应急储备安排机制】财联社19日讯，第二次金砖国家财长和央行行长会议在上海举行。各方认为应推动新开发银行取得新发展；建立PPP领域合作框架；推动金融机构和金融服务网络化布局；同意就会计准则趋同和审计监管等效开展合作；发展和完善金砖国家应急储备安排机制（CRA）；进一步就开展货币互换、本币清算和本币直接投资等货币合作加强沟通与协调；完善国际税收协调机制；加强反洗钱和反恐融资合作等。 ","date":"2017-06-19 13:08:00"},{"title":"【中国石油海外油气业务体制机制改革全面启动】财联社19日讯，在6月16日召开的中国石油集团全面深化改革领导小组第十八次会议上，审议通过了《集团公司海外油气业务体制机制改革框架方案》和《集团公司多种经营业务深化改革指导意见》。两个方案意见的审议通过，标志着中国石油海外油气业务体制机制改革和多种经业务深化改革工作开始全面启动。（中国石油报） ","date":"2017-06-19 12:35:00"},{"title":"【金砖国家财长和央行行长会议：建立PPP领域合作框架】财联社19日讯，2017年第二次金砖国家财长和央行行长会议在上海举行。会上，各方强调应进一步加强宏观经济政策协调，促进金砖国家和世界经济增长。建立政府和社会资本合作（PPP）领域合作框架，为金砖国家开展PPP合作打下坚实基础。 ","date":"2017-06-19 12:29:00"},{"title":"财联社19日讯，中国将坚持严格的电动汽车配额。（德国商报） ","date":"2017-06-19 12:22:00"},{"title":"【午间公告】财联社17日讯，南兴装备：停牌系拟筹划与互联网综合服务相关的资产收购事项。 ","date":"2017-06-19 11:43:00"},{"title":"【午间公告】财联社17日讯，南兴装备：停牌系拟筹划与互联网综合服务相关的资产收购事项；沙钢股份：收购苏州卿峰股权协议未达生效条件，目前无约束力；和顺电气：中标新能源电动车充电桩项目，金额约为3124.52万元；鸿路钢构：签订宣城绿色智能制造项目，拟在宣城市设立智能制造基地；华锋股份拟筹划重大资产重组，标的资产包括新能源汽车和电极箔行业；美芝股份正在筹划重大事项，涉及收购重大资产。 ","date":"2017-06-19 11:43:00"},{"title":"【午间公告】财联社17日讯，南兴装备：停牌系拟筹划与互联网综合服务相关的资产收购事项；沙钢股份：收购苏州卿峰股权协议未达生效条件，目前无约束力；和顺电气：中标新能源电动车充电桩项目，金额约为3124.52万元；鸿路钢构：签订宣城绿色智能制造项目，拟在宣城市设立智能制造基地；华锋股份拟筹划重大资产重组，标的资产包括新能源汽车和电极箔行业；美芝股份正在筹划重大事项，涉及收购重大资产；莱茵体育：控股孙公司约7000万元竞得一块土地使用权，主要用途为嘉兴秀湖体育综合体项目建设。 ","date":"2017-06-19 11:43:00"},{"title":"【午间公告】财联社17日讯，南兴装备：停牌系拟筹划与互联网综合服务相关的资产收购事项；沙钢股份：收购苏州卿峰股权协议未达生效条件，目前无约束力；和顺电气：中标新能源电动车充电桩项目，金额约为3124.52万元；鸿路钢构：签订宣城绿色智能制造项目，拟在宣城市设立智能制造基地；华锋股份拟筹划重大资产重组，标的资产包括新能源汽车和电极箔行业；美芝股份正在筹划重大事项，涉及收购重大资产；莱茵体育：控股孙公司约7000万元竞得一块土地使用权，主要用途为嘉兴秀湖体育综合体项目建设；云南白药股东合和集团减持计划完成过半，5月24日至6月15日减持521.26万股；恒锋工具推184万份股权激励。 ","date":"2017-06-19 11:43:00"},{"title":"【国债期货高开高走午盘大幅收红】财联社19日讯，10年期国债期货主力合约T1709午盘涨0.49%，5年期主力合约TF1709午盘涨0.29%。 ","date":"2017-06-19 11:31:00"}]
     * code : 0
     */

    private String message;
    private int code;
    private List<Data> data;

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public List<Data> getData() {
        return data;
    }

    public void setData(List<Data> data) {
        this.data = data;
    }

    public static class Data {
        /**
         * title : 【财政部：重点支持符合雄安新区等国家战略的PPP项目开展资产证券化】财联社19日讯，财政部近日印发关于规范开展政府和社会资本合作项目资产证券化有关事宜的通知。通知要求分类稳妥地推动PPP项目资产证券化，严格筛选开展资产证券化的PPP项目，重点支持符合雄安新区和京津冀协同发展、“一带一路”、长江经济带等国家战略的PPP项目开展资产证券化。
         * date : 2017-06-19 15:08:00
         */

        private String title;
        private String date;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getDate() {
            return date;
        }

        public void setDate(String date) {
            this.date = date;
        }
    }
}
